app/controllers/aportes_controller.rb

  def index
    @aportes = Aporte.all
---
SELECT "aportes".* FROM "aportes"

  def show
    @aporte = Aporte.find(params[:id])
---
SELECT "aportes".* FROM "aportes" WHERE "aportes"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @aporte = Aporte.new(params[:aporte])

    respond_to do |format|
      if @aporte.save
---
INSERT INTO "aportes" ("category", "content", "created_at", "fecha", "file", "file2", "file3", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def aprobar

  @aportei = Aporte.find(params[:id])
  @post  = Post.new

  @post.name = @aportei.name
  @post.title= @aportei.title
  @post.content = @aportei.content

  @post.file =@aportei.file
  @post.file2 = @aportei.file2
  @post.file3 = @aportei.file3


  if @post.save
---
SELECT "aportes".* FROM "aportes" WHERE "aportes"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "posts" ("category", "content", "created_at", "dropbox_session", "fecha", "file", "file2", "file3", "name", "slug", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)