app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show

    @ip =request.remote_ip
    @post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "posts" SET "category" = 'Informativo', "title" = 'Primera Asamblea!', "content" = 'No faltes se trataran todos los puntos mas importantes del Universo y blah ablah blah', "file" = 'v1350880070/i9gqaamwa7qwved4w1vn.png', "slug" = 'primera-asamblea', "updated_at" = '2013-04-24 02:46:02.995068' WHERE "posts"."id" = 5
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 12]]
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy