app/controllers/welcomes_controller.rb

  def index
    @welcomes = Post.last(7)
---
SELECT "posts".* FROM "posts" ORDER BY id DESC LIMIT 7